stm32LLD/timer/src/timer.c
#if defined(TIM2)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        TIM2 IRQ
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void TIM2_IRQHandler(void)
    {
        // TODO: Process TIM2 IRQ
    }
#endif

#if defined(TIM3)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        TIM3 IRQ
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void TIM3_IRQHandler(void)
    {
        // TODO: Process TIM3 IRQ
    }
#endif

#if defined(TIM4)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        TIM4 IRQ
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void TIM4_IRQHandler(void)
    {
        // TODO: Process TIM4 IRQ
    }
#endif

#if defined(TIM5)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        TIM5 IRQ
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void TIM5_IRQHandler(void)
    {
        // TODO: Process TIM5 IRQ
    }
#endif

#if defined(TIM8)
    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        TIM8 BRK IRQ
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void TIM8_BRK_IRQHandler(void)
    {
        // TODO: Process TIM8 BRK IRQ
    }

    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        TIM8 UP IRQ
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void TIM8_UP_IRQHandler(void)
    {
        // TODO: Process TIM8 UP IRQ
    }

    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        TIM8 TRG,COM IRQ
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void TIM8_TRG_COM_IRQHandler(void)
    {
        // TODO: Process TIM8 TRG,COM IRQ
    }

    ////////////////////////////////////////////////////////////////////////////////
    /*!
    * @brief        TIM8 CC IRQ
    *
    * @return       void
    */
    ////////////////////////////////////////////////////////////////////////////////
    void TIM8_CC_IRQHandler(void)
    {
        // TODO: Process TIM8 CC IRQ
    }
#endif


////////////////////////////////////////////////////////////////////////////////
/**
* @} <!-- END GROUP -->
*/
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
/**
*@addtogroup TIMER_API
* @{ <!-- BEGIN GROUP -->
*
* 	Following function are part of Timer LL Driver API.
*/
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Initialize timer
*
* @param[in]    tim_inst    - Timer instance
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
timer_status_t timer_init(const timer_inst_t tim_inst)
{
    timer_status_t          status              = eTIMER_OK;
    TIM_ClockConfigTypeDef  sClockSourceConfig  = {0};

    TIMER_ASSERT( tim_inst < eTIM_INST_NUM_OF );

    if ( tim_inst < eTIM_INST_NUM_OF )
    {
        if ( false == g_tim_inst[tim_inst].is_init )
        {
            // Get timer configurations
            const tim_inst_cfg_t * p_cfg = timer_cfg_get_inst( tim_inst );

            // Init timer clock
            timer_enable_clock( p_cfg->p_instance );

            // Prepare HAL init structure
            g_tim_inst[tim_inst].handle.Instance                = p_cfg->p_instance;
            g_tim_inst[tim_inst].handle.Init.Prescaler          = p_cfg->psc;
            g_tim_inst[tim_inst].handle.Init.CounterMode        = p_cfg->mode;
            g_tim_inst[tim_inst].handle.Init.Period             = p_cfg->per;
            g_tim_inst[tim_inst].handle.Init.ClockDivision      = TIM_CLOCKDIVISION_DIV1;
            g_tim_inst[tim_inst].handle.Init.AutoReloadPreload  = TIM_AUTORELOAD_PRELOAD_DISABLE;

            // Init timer
            if ( HAL_OK != HAL_TIM_Base_Init( &g_tim_inst[tim_inst].handle ))
            {
                status |= eTIMER_ERROR;
                TIMER_ASSERT( 0 );
            }

            // Internal clock source
            sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;

            // Init timer clock source
            if ( HAL_OK != HAL_TIM_ConfigClockSource( &g_tim_inst[tim_inst].handle, &sClockSourceConfig ))
            {
                status |= eTIMER_ERROR;
                TIMER_ASSERT( 0 );
            }

            // Init success
            if ( eTIMER_OK == status )
            {
                // TODO: Enable interrupt that are needed by specific timer profile
                //__HAL_TIM_ENABLE_IT( &g_tim_inst[tim_inst].handle, TIM_IT_UPDATE );
                //__HAL_TIM_ENABLE_IT( &g_tim_inst[tim_inst].handle, TIM_IT_CC2 );

                // TODO:  Setup timer interrupt priority and enable it
                //NVIC_SetPriority( p_cfg->irq_num, p_cfg->irq_prio );
                //NVIC_EnableIRQ( p_cfg->irq_num );

                // Init success
                g_tim_inst[tim_inst].is_init = true;

                // Start timer
                if ( true == p_cfg->start )
                {
                    status |= timer_start( tim_inst );
                }
            }
        }
    }
    else
    {
        status = eTIMER_ERROR;
    }


