stm32LLD/timer/src/timer.c
    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Set duty cycle
*
*   Execution time (@150MHz CPU clock): TODO:
*
* @param[in]    duty_u      - Duty cycle for phase U. Valid range: 0-1
* @param[in]    duty_v      - Duty cycle for phase V. Valid range: 0-1
* @param[in]    duty_w      - Duty cycle for phase W. Valid range: 0-1
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
__attribute__((optimize("Ofast"))) timer_status_t timer_1_set_pwm(const float32_t duty_u, const float32_t duty_v, const float32_t duty_w)
{
    timer_status_t status = eTIMER_OK;

    TIMER_ASSERT(( duty_u >= 0.0f ) && ( duty_u <= 1.0f ))
    TIMER_ASSERT(( duty_v >= 0.0f ) && ( duty_v <= 1.0f ))
    TIMER_ASSERT(( duty_w >= 0.0f ) && ( duty_w <= 1.0f ))

    // Get period
    const uint32_t period = (uint32_t) __HAL_TIM_GET_AUTORELOAD( &gh_tim1 );

    // Limit duty cycles
    const float32_t duty_u_lim = timer_1_limit_duty( duty_u );
    const float32_t duty_v_lim = timer_1_limit_duty( duty_v );
    const float32_t duty_w_lim = timer_1_limit_duty( duty_w );

    // Calculate compare
    const uint32_t ccr1 = (uint32_t)( duty_u_lim * (float32_t) period );
    const uint32_t ccr2 = (uint32_t)( duty_v_lim * (float32_t) period );
    const uint32_t ccr3 = (uint32_t)( duty_w_lim * (float32_t) period );

    // Set compare
    __HAL_TIM_SET_COMPARE( &gh_tim1, TIM_CHANNEL_1, ccr1 );
    __HAL_TIM_SET_COMPARE( &gh_tim1, TIM_CHANNEL_2, ccr2 );
    __HAL_TIM_SET_COMPARE( &gh_tim1, TIM_CHANNEL_3, ccr3 );

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Enable/Disable pwm pins
*
* @param[in]    en      - Enable/Disable PWM pins
* @return       status  - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
timer_status_t timer_1_pwm_en(const bool en)
{
    timer_status_t status = eTIMER_OK;

    if ( true == en )
    {
        timer_1_init_gpio();
    }
    else
    {
        timer_1_deinit_gpio();
    }

    return status;
}




/**
 *  Timer 4 Instance
 */
static TIM_HandleTypeDef gh_tim4 = {0};

static bool gb_tim4_is_init = false;



////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Initialize timer 4 pins
*
* @return       void
*/
////////////////////////////////////////////////////////////////////////////////
static void timer_4_init_gpio(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    // Enable clocks
    gpio_enable_port_clock( H1__PORT );
    gpio_enable_port_clock( H2__PORT );

    // Init H1 pin
    GPIO_InitStruct.Pin         = H1__PIN;
    GPIO_InitStruct.Mode        = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull        = H1__PULL;
    GPIO_InitStruct.Speed       = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Alternate   = H1__AF;
    HAL_GPIO_Init(H1__PORT, &GPIO_InitStruct);

    // Init H2 pin
    GPIO_InitStruct.Pin         = H2__PIN;
    GPIO_InitStruct.Pull        = H2__PULL;
    GPIO_InitStruct.Alternate   = H2__AF;
    HAL_GPIO_Init(H2__PORT, &GPIO_InitStruct);
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Initialize timer 4 as encoder reading
*
* @return       status - Status of initialization
*/
////////////////////////////////////////////////////////////////////////////////
timer_status_t timer_4_init(void)
{
    timer_status_t          status  = eTIMER_OK;
    TIM_Encoder_InitTypeDef sConfig = {0};

    if ( false == gb_tim4_is_init )
    {
        // Init Timer PWM gpios
        timer_4_init_gpio();

        // Enable timer clock
        __HAL_RCC_TIM4_CLK_ENABLE();

        // Configure Timer
        gh_tim4.Instance                = TIM4;
        gh_tim4.Init.Prescaler          = 0;
        gh_tim4.Init.CounterMode        = TIM_COUNTERMODE_UP;
        gh_tim4.Init.Period             = 9;
        gh_tim4.Init.ClockDivision      = TIM_CLOCKDIVISION_DIV1;
        gh_tim4.Init.AutoReloadPreload  = TIM_AUTORELOAD_PRELOAD_DISABLE;

        // Configure encoder timer mode
        sConfig.EncoderMode             = TIM_ENCODERMODE_TI12;
        sConfig.IC1Polarity             = TIM_ICPOLARITY_RISING;
        sConfig.IC1Selection            = TIM_ICSELECTION_DIRECTTI;
        sConfig.IC1Prescaler            = TIM_ICPSC_DIV1;
        sConfig.IC1Filter               = 0;
        sConfig.IC2Polarity             = TIM_ICPOLARITY_RISING;
        sConfig.IC2Selection            = TIM_ICSELECTION_DIRECTTI;
        sConfig.IC2Prescaler            = TIM_ICPSC_DIV1;
        sConfig.IC2Filter               = 0;

        // Init timer as encoder
        if ( HAL_OK != HAL_TIM_Encoder_Init( &gh_tim4, &sConfig ))
        {
            status = eTIMER_ERROR;
        }
        else
        {
            gb_tim4_is_init = true;

            // Start Timer
            HAL_TIM_Encoder_Start( &gh_tim4, TIM_CHANNEL_ALL );
        }
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Get timer 4 counts
*
* @param[out]   p_counter   - Pointer to encoder ticks
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
timer_status_t timer_4_cnt_get(uint32_t * const p_counter)
{
    timer_status_t status = eTIMER_OK;

    TIMER_ASSERT( true == gb_tim4_is_init );
    TIMER_ASSERT( NULL != p_counter );

    if  (   ( true == gb_tim4_is_init )
        &&  ( NULL != p_counter ))
    {
        *p_counter = __HAL_TIM_GET_COUNTER( &gh_tim4 );
    }
    else
    {
        status = eTIMER_ERROR;
    }

    return status;
}



////////////////////////////////////////////////////////////////////////////////
/**
* @} <!-- END GROUP -->
*/
////////////////////////////////////////////////////////////////////////////////
